<?php

namespace Database\Seeders;

use App\Models\Organization;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class OrganizationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Organization::create([
            'name_ar' => 'ضيوف البيت',
            'name_en' => 'Albait Guest',
            'slug' => 'ALG',
            'domain' => 'https://albaitguests-dev.rmcc.sa',
            'sender_id' => '1',
            'about_us' => 'منذ سنوات طويلة، نالت ضيوف البيت – من خلال الشركة الأم "مطوفي حجاج جنوب آسيا" - ثقة الحاج من خلال تقديم خدمات ضيافة بمعايير جودة عالمية ومصداقية في الوفاء بالالتزامات تجاه كل فرد. كما نعمل باستمرار على تطوير وتيسير الحج وتوفير تجربته لأكبر عدد من المسلمين حول العالم. نحن متخصصون وخبراء في تقديم خدمات تشمل كافة نواحي الحج بدءاً من مرحلة التخطيط للرحلة إلى أداء المناسك والاعاشة ثم العودة الآمنة للديار بالمبرة والغفران بمشيئة الله. ',
            'policies' => 'تيسير الحج لكل مسلمي العالم وتسهيل أداؤه بفعالية وتقديم خدمات بأعلى معايير الجودة تتوافق مع متطلبات كل حاج و توفر له تجربة حج آمنة لا ينساها مدى الحياة',
            'phone' => '557436279',
            'has_esnad' => '1',
            'close_registeration' => '1',
            'close_order' => '1',
            'primary_color' => '#CAB272',
            'email' => 'albait_guest@albait.co',
            'city_id' => '6',
            'district_id' => '871',
            'postal_code' => '543678',
            'building_number' => '4326',
            'sub_number' => '5547',
            'release_date' => '1999-10-10',
            'release_date_hj' => '1420-05-20',
            'street_name' => 'King Fahd',
            'registration_number' => '6666666666',
            'registration_source' => '6',
            'support_phone' => '966570077055',
    
    
        ]);
        Organization::create([
            'name_ar' => 'اثراء',
            'name_en' => 'ithraa',
            'slug' => 'ITH',
            'domain' => 'https://ithraa-dev.rmcc.sa',
            'about_us' => 'منذ سنوات طويلة، نالت ضيوف البيت – من خلال الشركة الأم "مطوفي حجاج جنوب آسيا" - ثقة الحاج من خلال تقديم خدمات ضيافة بمعايير جودة عالمية ومصداقية في الوفاء بالالتزامات تجاه كل فرد. كما نعمل باستمرار على تطوير وتيسير الحج وتوفير تجربته لأكبر عدد من المسلمين حول العالم. نحن متخصصون وخبراء في تقديم خدمات تشمل كافة نواحي الحج بدءاً من مرحلة التخطيط للرحلة إلى أداء المناسك والاعاشة ثم العودة الآمنة للديار بالمبرة والغفران بمشيئة الله. ',
            'policies' => 'تيسير الحج لكل مسلمي العالم وتسهيل أداؤه بفعالية وتقديم خدمات بأعلى معايير الجودة تتوافق مع متطلبات كل حاج و توفر له تجربة حج آمنة لا ينساها مدى الحياة',
            'phone' => '557436279',
            'has_esnad' => '1',
            'close_registeration' => '1',
            'close_order' => '1',
            'primary_color' => '#CAB272',
            'email' => 'ithraa@ithraa.co',
            'city_id' => '6',
            'district_id' => '871',
            'postal_code' => '543678',
            'building_number' => '4326',
            'sub_number' => '5547',
            'release_date' => '1999-10-10',
            'release_date_hj' => '1420-05-20',
            'street_name' => 'King Fahd',
            'registration_number' => '6666666666',
            'registration_source' => '6',
            'support_phone' => '966570077055',
        ]);
        Organization::create([
            'name_ar' => 'ركايا',
            'name_en' => 'Rakaya',
            'slug' => 'RKY',
            'domain' => 'https://rakaya-dev.rmcc.sa',
            'about_us' => 'ركايــا شــركة متخصصــة فــي تقديــم الاستشــارات الإداريــة والحلــول المبتكــرة لتطويــر الأعمــال, نهــدف إلــى رفــع أداء شــركات عملائنــا ووضـع خطـط تطويريـة وبنـاء علاقـة طويلـة الأمــد مــن خــلال الاســتجابة الســريعة والحــرص علــى كافــة التفاصيــل مــن قبــل فريــق المستشــارين المتخصصين وفريق عمل مميز .',
            'policies' => 'يشير إلى هذه الوثيقة بما تتضمنه من شروط وأحكام مخصصة لاستخدام المنصة، وكذلك أي اتفاقات خاصة، وسياسة الخصوصية، وكافة الاتفاقيات الخاصة التي تربطنا بالعميل/ المستخدم، وكافة العقود المرتبطة بشكل مباشر أو غير مباشر بالشروط والأحكام، كما تشمل هذه الاتفاقية المحتوى الخاص بنا المنشور عبر الصفحة الرئيسية للمنصة أو الصفحات الفرعية أو المرسل عبر البريد الإلكتروني أو عبر الهاتف المحمول أو عبر صفحات التواصل الخاصة بنا، والذي يتضمن وصف الخدمات والمعلومات والصور التوضيحية وأي تعليمات ملزمة للمستخدمين.

             تحتفظ المنصة بحق تعديل أو تغيير هذه الأحكام والشروط دون إخطار مسبق ويكون من مسؤوليتك كمستخدم للمنصة مراجعة ضوابط وشروط الاستخدام بشكل دوري لمعرفة التحديثات التي تطرأ على الأحكام والشروط هذه
            
            أنت تقر وتضمن أنه لم يسبق أن تم تعطيل استخدامك لخدمات المنصة أو منعك من استخدامها في أي وقت من الأوقات. أنك لست منافساً للمنصة، كما أنك لا تقدم أي منتج منافس للخدمات المقدمة من المنصة. أنك تتمتع بكامل الأهلية للتعاقد وأنك بذلك لن تكون منتهكاً لأي قانون أو عقد، وأنه لا يوجد عليك أي سوابق قضائية أو أوامر قبض أو مطالبات لدى الجهات الأمنية.
            
            أنت تقر وتضمن بأنك سوف تمتثل لكافة القوانين واللوائح المعمول بها في المملكة العربية السعودية, تقدم معلومات صحيحة ودقيقة إلى المنصة وتقوم بتحديثها بشكل دوري, تمتثل لأي إشعارات يتم إرسالها من خلال المنصة فيما يتعلق باستخدامكم للخدمات المقدمة من المنصة, سوف تستخدم المنصة لأغراض مشروعة فقط، ولن تستخدم الخدمات لشراء أو استلام أي مواد غير قانونية أو بهدف الاحتيال او التجسس او انتهاك للخصوصية بأي شكل من الأشكال, لن تستخدم المنصة للتسبب بإيذاء أو مضايقة أو إزعاج أحد ما, توافق على تبادل معلوماتك داخل المنصة فيما يخص الموقع والكاميرا وتقييم التعاملات معك.
            
            تمنحك المنصة ترخيص غير حصري، وغير قابل للتحويل، وغير قابل للتنازل، وغير قابل للترخيص من الباطن وغير قابل للإلغاء وذلك للحصول على خدماتنا واستخدامها فقط للغرض المخصص لها (ليس لأي أغراض تجارية على سبيل المثال لا الحصر) وفقاً لهذه الاتفاقية، لذا يجب عليك: عدم إتاحة الخدمات، أو تأجير، أو استئجار أو تخصيص أو إعادة بيع، أو توزيع أو ترخيص من الباطن لهذه الخدمات إلى أي طرف ثالث. 
            
            جميع حقوق الملكية الفكرية لهذه المنصة وكافة المواد المتعلقة بها أو التي تظهر عليها (وتشمل اي محتوى تقوم المنصة بتقديمها أو بإدراجها وكامل المحتوى الذي يتم تحميله على المنصة من قبل المنصة ومهندسيها هو ملكية لـ منصة المنصة، ويحق لـ المنصة التصرف في هذه الملكية كيفما تشاء. ويجب عليك ألا تقوم بإعادة إنتاج أو السماح لأي شخص، لأي سبب من الأسباب، باستخدام أو إعادة إنتاج الخدمات أو أي علامات تجارية أو غيرها من الأسماء التجارية التي تظهر في الخدمات.
            
            بموافقتك على شروط المستخدم الماثلة واستخدام المنصة أو الخدمة، فإنك توافق على الدفاع عن المنصة والشركات التابعة لها والجهات المرخِّصة لها وكل مسؤول من مسؤوليها ومديريها وغيرهم من المستخدمين والموظفين والمحامين والوكلاء وعدم إلحاق الضرر بهم وإبراء ذمتهم من أي مطالبات وتكاليف وأضرار وخسائر ومسؤوليات ومصروفات (بما في ذلك أتعاب وتكاليف المحاماة) تنشأ عن أو ترتبط بانتهاك أو مخالفتك لأي شرط من شروط المستخدم الماثلة هذه أو لأي قانون أو لوائح معمول بها في المملكة العربية السعودية، سواء أشير إليها في شروط وأحكام الاستخدام هذه أم لا, انتهاك لأي حقوق تخص الغير، بما في ذلك مُقدمي الخدمات الذين تنظمهم المنصة, استخدامك أو إساءة استخدامك للمنصة أو الخدمات التي تقدمها.
            
            المعلومات والتوصيات والخدمات أو أي منها التي قُدمت لك على أو من خلال المنصة هي لأغراض المعلومات العامة فقط ولا تمثل أي نصيحة. ستحافظ المنصة قدر الإمكان على صحة وتحديث المنصة ومحتوياتها، لكنها لا تضمن أن (محتويات) الموقع أو المنصة خالية من الأخطاء والعيوب والبرامج الضارة والفيروسات ولا تضمن صحة ودقة وتحديث التطبيق والمنصة. لا تتحمل المنصة المسؤولية عن أي أضرار تنتج عن استخدام (أو عدم القدرة على استخدام) المنصة، بما في ذلك الأضرار التي تسببها البرامج الضارة أو الفيروسات، كما لا تتحمل مسؤولية عدم صحة أو عدم اكتمال المعلومات أو المنصة.
            
            إنك تقر بتحملك المسئولية منفرداً عن خصوصية الخدمات، وتكون مسئولاً منفرداً عن استخدامها من قبل أي شخص آخر باستخدام حسابك و/أو اسم المستخدم أو كلمة المرور أو مسوغات الوصول الخاصة بك. كما أنك توافق على إخطار المنصة إذا أصبحت على علم بأي خسارة، أو سرقة، أو استخدام غير مصرح به لأي كلمة مرور، أو اسم مستخدم أو عنوان بروتوكول الإنترنت IP، أو غير ذلك من أساليب الوصول إلى الخدمات.
            
            لا يؤثر بطلان أي حكم من أحكام شروط المستخدم الماثلة على صحة باقي الأحكام الأخرى الواردة فيها. في حالة وجود أي حكم باطل في شروط المستخدم الماثلة أو وجود حكم غير مقبول في ظروف معينة وفقًا لمعايير المعقولية والعدالة وإلى هذا المدى فقط، يُعمل بدلاً منه بين الطرفين بحكم يكون مقبولاً مراعاةً لجميع الظروف ويتوافق مع أحكام الشرط الباطل قدر الإمكان، مع مراعاة محتوى شروط المستخدم الماثلة وغرضها.
            
            تحتفظ المنصة لنفسها بالحق، وفقًا لتقديرها وحدها، في تعديل أي شرط من شروط المستخدم الماثلة أو استبداله، أو تغيير الخدمة أو المنصة أو تعليقها أو إيقافها (بما في ذلك على سبيل المثال لا الحصر، توفير أي ميزة أو قاعدة بيانات أو محتوى) في أي وقت، وذلك بنشر إخطار على التطبيق أو بإرسال إخطار لك من خلال المنصة أو عبر البريد الإلكتروني. كما يجوز للمنصة أن تضع قيودًا على ميزات وخدمات مُعيَّنة أو تقصر وصولك إلى أجزاء من الخدمة أو الخدمة بأكملها دون إخطار أو مسؤولية.
            ',
            'phone' => '570044066',
            'has_esnad' => '1',
            'close_registeration' => '1',
            'close_order' => '1',
            'primary_color' => '#CAB272',
            'email' => 'rakaya@rakaya.co',
            'city_id' => '1',
            'district_id' => '871',
            'postal_code' => '543678',
            'building_number' => '4326',
            'sub_number' => '5547',
            'release_date' => '1999-10-10',
            'release_date_hj' => '1420-05-20',
            'street_name' => 'King Fahd',
            'registration_number' => '6666666666',
            'registration_source' => '1',
            'support_phone' => '966570077055',
        ]);
        Organization::create([
            'name_ar' => 'محلي',
            'name_en' => 'Local',
            'slug' => 'LCL',
            'domain' => 'http://localhost:5173',
            // 'whatsapp_instance_id' => 'instance693199',
            // 'whatsapp_token' => 'om7h2t171ory4n6mm',
        ]);
    }
}